Revit 2027 API
PipeSegment.ScheduleTypeId Property
 The ElementId of the PipeScheduleType.
Namespace: Autodesk.Revit.DB.Plumbing
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId ScheduleTypeId { get; }
Public ReadOnly Property ScheduleTypeId As ElementId
	Get
public:
property ElementId^ ScheduleTypeId {
	ElementId^ get ();
}
member ScheduleTypeId : ElementId with get
Property Value
ElementId
See Also
Reference
PipeSegment Class
Autodesk.Revit.DB.Plumbing Namespace